#include <stdio.h> 
#include <string.h>
int main() {

    switch (expression)
    {
        case 'l': 
            /* code подсчет длины строки */
            break;

        case 'r':
            /* code переворот (reverse) строки*/
            break;

        case 'u':
            /* code  преобразовать каждый элемент, стоящий на нечетной позиции в верхний регистр*/
            break;

        case 'n':
            /* code переписать строку так, чтобы в начале строки были символы цифр, затем символы букв, а в конце – прочие символы в порядке, определённом исходной строкой*/
            break;

        case 'c':
            /* code конкатенация со строкой, которая передается третьим аргументо*/
            break;

        default:
            break;
    }
}
